# Panda Dataframe

Importing necessary libraries

In [3]:
import os

In [2]:
import pandas as pd

Changing the working directory

In [6]:
os.chdir("G:\rushabh\STUDY\PYTHON")

OSError: [WinError 123] The filename, directory name, or volume label syntax is incorrect: 'G:\rushabh\\STUDY\\PYTHON'

## Importing Data

In [7]:
cars_data=pd.read_csv("toyota.csv")

### To make first column as index column

In [8]:
cars_data=pd.read_csv("toyota.csv",index_col=0)

# Creating Copy of Data

## 1. Shallow Copy
## 2. Deep Copy

In [9]:
samp=cars_data.copy(deep=False)   #Shallow Copy
samp1=cars_data.copy(deep=True)   #Deep Copy

In [ ]:
samp=cars_data                  #Shallow Copy

# Attributes of Data

## Dataframe.index

print(samp.index)

##  Dataframe.columns

samp.columns

##  Dataframe.size

## Dataframe.shape

## Dataframe.memory_usage([index,deep])

## DataFrame.ndim

# Indexing and Selecting Data

In [14]:
samp.head(6)

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel  90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel  90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel  90       0.0          0  2000      3    1170
5  12950  32.0  61000   Diesel  90       0.0          0  2000      3    1170

In [16]:
samp.tail(5)

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [17]:
samp.at[4,"FuelType"]

'Diesel'

In [22]:
samp.iat[4,1]

30.0

In [23]:
samp.loc[:,"FuelType"]

0       Diesel
1       Diesel
2       Diesel
3       Diesel
4       Diesel
         ...
1431    Petrol
1432    Petrol
1433    Petrol
1434       NaN
1435    Petrol
Name: FuelType, Length: 1436, dtype: object

# Data Type

Types of data:
1. Numeric

2.Character

## 1.Numeric Type

### Python Data Type         
     int                         float                     
### Pandas Data Type
     int64                       float64

## 2. Character Type

### a) Category
### b) Object

Checking Data Types of each Column 

Syntax: DataFrame.dtypes

In [24]:
samp.dtypes

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

Counting of Unique data types

Syntax:DataFrame.get_dtype_counts()

In [25]:
samp.get_dtype_counts()

C:\Users\HP\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: `get_dtype_counts` has been deprecated and will be removed in a future version. For DataFrames use `.dtypes.value_counts()
  """Entry point for launching an IPython kernel.

float64    2
int64      4
object     4
dtype: int64

Selecting data based on data types

Syntax: DataFrame.select_dtypes(include=None,exclude=None)

In [26]:
samp.select_dtypes(exclude=[object])

      Price   Age  MetColor  Automatic    CC  Weight
0     13500  23.0       1.0          0  2000    1165
1     13750  23.0       1.0          0  2000    1165
2     13950  24.0       NaN          0  2000    1165
3     14950  26.0       0.0          0  2000    1165
4     13750  30.0       0.0          0  2000    1170
...     ...   ...       ...        ...   ...     ...
1431   7500   NaN       1.0          0  1300    1025
1432  10845  72.0       0.0          0  1300    1015
1433   8500   NaN       0.0          0  1300    1015
1434   7250  70.0       1.0          0  1300    1015
1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 6 columns]

In [28]:
samp.select_dtypes(include=[object])

         KM FuelType   HP  Doors
0     46986   Diesel   90  three
1     72937   Diesel   90      3
2     41711   Diesel   90      3
3     48000   Diesel   90      3
4     38500   Diesel   90      3
...     ...      ...  ...    ...
1431  20544   Petrol   86      3
1432     ??   Petrol   86      3
1433  17016   Petrol   86      3
1434     ??      NaN   86      3
1435      1   Petrol  110      5

[1436 rows x 4 columns]

Concise summary of Dataframe

Syntax: DataFrame.info()

In [29]:
samp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
Price        1436 non-null int64
Age          1336 non-null float64
KM           1436 non-null object
FuelType     1336 non-null object
HP           1436 non-null object
MetColor     1286 non-null float64
Automatic    1436 non-null int64
CC           1436 non-null int64
Doors        1436 non-null object
Weight       1436 non-null int64
dtypes: float64(2), int64(4), object(4)
memory usage: 163.4+ KB

Unique element of elements of columns

Syntax: numpy.unique(array)

import numpy as np
print(np.unique(samp['KM']))

'KM' has read as object because of '????'

In [32]:
print(np.unique(samp['HP']))

['107' '110' '116' '192' '69' '71' '72' '73' '86' '90' '97' '98' '????']

In [33]:
print(np.unique(samp['MetColor']))

[ 0.  1. nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan]

'Metacolor' has read as float64 because of 0,1

In [34]:
print(np.unique(samp['Automatic']))

[0 1]

In [35]:
print(np.unique(samp['Doors']))

['2' '3' '4' '5' 'five' 'four' 'three']

#  Importing Data

misssing values : 'nan','??','???"

#### Replacing '??','?????' with 'nan'

In [41]:
samp=pd.read_csv('Toyota.csv',index_col=0,na_values=['??','????'])

In [42]:
samp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
Price        1436 non-null int64
Age          1336 non-null float64
KM           1421 non-null float64
FuelType     1336 non-null object
HP           1430 non-null float64
MetColor     1286 non-null float64
Automatic    1436 non-null int64
CC           1436 non-null int64
Doors        1436 non-null object
Weight       1436 non-null int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

# Converting Variable's Data type

Syntax: DataFrame.astype(dtype)

explicitly convert data types

In [47]:
samp['MetColor']=samp['MetColor'].astype('object')
samp['Automatic']=samp['Automatic'].astype('object')

In [48]:
samp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
Price        1436 non-null int64
Age          1336 non-null float64
KM           1421 non-null float64
FuelType     1336 non-null object
HP           1430 non-null float64
MetColor     1286 non-null object
Automatic    1436 non-null object
CC           1436 non-null int64
Doors        1436 non-null object
Weight       1436 non-null int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

# Category vs Object Data Type

Total Bytes consumed by elements of columns


Syntax: ndarray.nbytes

In [49]:
samp['FuelType'].nbytes  #Bytes of object

11488

In [51]:
samp['FuelType'].astype('category').nbytes    #Bytes of category

1460

## Re-checking the data type of variables

In [52]:
samp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
Price        1436 non-null int64
Age          1336 non-null float64
KM           1421 non-null float64
FuelType     1336 non-null object
HP           1430 non-null float64
MetColor     1286 non-null object
Automatic    1436 non-null object
CC           1436 non-null int64
Doors        1436 non-null object
Weight       1436 non-null int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

## Cleaning column 'Doors'

In [53]:
print(np.unique(samp['Doors']))

['2' '3' '4' '5' 'five' 'four' 'three']

### replace()

Syntax: DataFrame.replac([to_replace,value])

In [54]:
samp['Doors'].replace('three',3,inplace=True)
samp['Doors'].replace('four',4,inplace=True)
samp['Doors'].replace('five',5,inplace=True)

In [64]:
print(help(np.where))

Help on built-in function where in module numpy:

where(...)
    where(condition, [x, y])

    Return elements chosen from `x` or `y` depending on `condition`.

    .. note::
        When only `condition` is provided, this function is a shorthand for
        ``np.asarray(condition).nonzero()``. Using `nonzero` directly should be
        preferred, as it behaves correctly for subclasses. The rest of this
        documentation covers only the case where all three arguments are
        provided.

    Parameters
    ----------
    condition : array_like, bool
        Where True, yield `x`, otherwise yield `y`.
    x, y : array_like
        Values from which to choose. `x`, `y` and `condition` need to be
        broadcastable to some shape.

    Returns
    -------
    out : ndarray
        An array with elements from `x` where `condition` is True, and elements
        from `y` elsewhere.

    See Also
    --------
    choose
    nonzero : The function that is called when x and y are omitted

    Notes
    -----
    If all the arrays are 1-D, `where` is equivalent to::

        [xv if c else yv
         for c, xv, yv in zip(condition, x, y)]

    Examples
    --------
    >>> a = np.arange(10)
    >>> a
    array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
    >>> np.where(a < 5, a, 10*a)
    array([ 0,  1,  2,  3,  4, 50, 60, 70, 80, 90])

    This can be used on multidimensional arrays too:

    >>> np.where([[True, False], [True, True]],
    ...          [[1, 2], [3, 4]],
    ...          [[9, 8], [7, 6]])
    array([[1, 8],
           [3, 4]])

    The shapes of x, y, and the condition are broadcast together:

    >>> x, y = np.ogrid[:3, :4]
    >>> np.where(x < y, x, 10 + y)  # both x and 10+y are broadcast
    array([[10,  0,  0,  0],
           [10, 11,  1,  1],
           [10, 11, 12,  2]])

    >>> a = np.array([[0, 1, 2],
    ...               [0, 2, 4],
    ...               [0, 3, 6]])
    >>> np.where(a < 4, a, -1)  # -1 is broadcast
    array([[ 0,  1,  2],
           [ 0,  2, -1],
           [ 0,  3, -1]])

None

### Converting 'Doors' to int64

In [65]:
samp['Doors']=samp['Doors'].astype('int64')

In [66]:
samp['Doors']

0       3
1       3
2       3
3       3
4       3
       ..
1431    3
1432    3
1433    3
1434    3
1435    5
Name: Doors, Length: 1436, dtype: int64